Revit 2027 API
FormatValueOptions.GetFormatOptions Method
 Gets the FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetFormatOptions()
Public Function GetFormatOptions As FormatOptions
public:
FormatOptions^ GetFormatOptions()
member GetFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
 A copy of the FormatOptions.
Remarks
 By default, the FormatOptions represents default formatting (UseDefault is true) and the FormatOptions in the Units class will be used.
See Also
Reference
FormatValueOptions Class
Autodesk.Revit.DB Namespace